/*-------------------------------------------------------------------------------------
 | 系统设置
 |-------------------------------------------------------------------------------------
 */
/**
 * 菜单管理-类型，1-分类，2-菜单，3-按钮，4-动作
 */
export function systemMenuTypeToStr(value) {
    let str = '';

    if (value == 1) {
        str = '分类';
    } else if (value == 2) {
        str = '菜单';
    } else if (value == 3) {
        str = '按钮';
    } else if (value == 4) {
        str = '动作';
    }

    return str;
}